{
    "druidcraft": {
        "name": "Druidcraft",
        "school": "transmutation",
        "level": 0,
        "castingTime": 1,
        "range": 30,
        "components": ["v", "s"],
        "duration": 0,
        "description": "Whispering to the spirits of nature, you create one of the following effects within range:\n- You create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for raid, falling snowflakes for snow, and so on. This effect persists for 1 round.\n- You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the fain odour of skunk. The effect must fit in a 5-foot cube.\n- You instantly light or snuff out a candle, a torch, or a small campfire."
    },
    "poisonSpray": {
        "name": "Poison Spray",
        "school": "conjuration",
        "level": 0,
        "castingTime": 1,
        "range": 10,
        "components": ["v", "s"],
        "duration": 0,
        "description": "You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a **Constitution** saving throw or take **1d12** **poison** damage.\n\nThe spell's damage increases by 1d12 when you reach **5th** level (**2d12**), **11th** level (**3d12**), and **17th** level (**4d12**)."
    },
    "resistance": {
        "name": "Resistance",
        "school": "abjuration",
        "level": 0,
        "castingTime": 1,
        "range": 0,
        "components": ["v", "s", "m"],
        "materials": "a miniature cloak",
        "duration": 10,
        "durationConditions": "concentration",
        "description": "You touch one willing creature. Once before the spell ends, the target can roll a **d4** and add the number rolled to one **saving throw** of its choice. It can roll the die before or after making the saving throw. The spell then ends."
    },
    "cureWounds": {
        "name": "Cure Wounds",
        "school": "evocation",
        "level": 1,
        "castingTime": 1,
        "range": 0,
        "components": ["v", "s"],
        "duration": 0,
        "description": "A creature you touch regains a number of hit points equal to **1d8** + your **spell casting ability modifier**. This spell has no effect on undead or constructs.\n\n**At Higher Levels.** When you cast this spell using a spell slot of 2nd level or higher, the healing increases by **1d8** for each slot level above 1st."
    }
}
